Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU.GetFlangeThicknessInFlangeCenter
Returns thickness of flange measured in the 0.5 * (width - webThickess),
sometimes used for sections with width > 300 mm.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU.GetFlangeThicknessInWidthCenter
Returns thickness of flange measured in the 0.5 * width,
sometimes used for sections with width <= 300 mm.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU.WebToeOfFillet
Detailing distance from outer face of flange to web toe of fillet, in. (mm)
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU.SlopedFlangeAngle
Sloped flange angle. (rad)
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU.FlangeToeOfFillet
Detailing distance from center of web to flange toe of fillet, in. (mm)
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU.FlangeFillet
Flange Fillet - fillet radius at the flange end.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams)
Creates a new instance of general Channel shape.
width:
Section width.
height:
Section height, depth.
flangeThickness:
Flange Thickness.
flangeThicknessLocation:
Flange Thickness Location.
flangeFillet:
Flange Fillet - fillet radius at the flange end.
flangeToeOfFillet:
Detailing distance from center of web to flange toe of fillet, in. (mm)
slopedFlangeAngle:
Sloped flange angle. (rad)
webThickness:
Web Thickness.
webFillet:
Web Fillet - fillet radius between web and flange.
webToeOfFillet:
Detailing distance from outer face of flange to web toe of fillet, in. (mm)
centroidHorizontal:
Distance from centroid to the left extremites along horizontal axis.
centroidVertical:
Distance from centroid to the upper extremites along vertical axis.
analysisParams:
Common set of parameters for structural analysis.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU
Defines parameters for general Channel shape.
Since:
2018